dannyf00/STM8Sduino/stm8sduino.c
#include "stm8sduino.h"					//we use aruidno port for stm8s

//global definitions
//struct used to map a pin to GPIO+mask
typedef struct {
	volatile GPIO_TypeDef *gpio;					//gpio for a pin
	uint8_t mask;						//pin mask - 8bit
} PIN2GPIO;

#define PWM_PR			((1ul<<PWMOUT_BITs) - 1)			//period for 16-bit pwm

//void empty handler for exti
void empty_handler(void) {
	//do nothing
}

#if defined(USE_EXTI)
//exti handlers
static void (*_isrptr_extia) (void)=empty_handler;					//tim isr handler ptr
static void (*_isrptr_extib) (void)=empty_handler;					//tim isr handler ptr
static void (*_isrptr_extic) (void)=empty_handler;					//tim isr handler ptr
static void (*_isrptr_extid) (void)=empty_handler;					//tim isr handler ptr
static void (*_isrptr_extie) (void)=empty_handler;					//tim isr handler ptr

//exti handlers
#pragma vector = EXTI0_vector					//exti 0 interrupt
__interrupt void extia_isr(void) {
//INTERRUPT_HANDLER(extia_isr, EXTI0_vector) {
	//clear the flag
	_isrptr_extia();							//execute the isr handler
}

#pragma vector = EXTI1_vector					//exti 0 interrupt
__interrupt void extib_isr(void) {
//INTERRUPT_HANDLER(extib_isr, EXTI1_vector) {
	//clear the flag
	_isrptr_extib();							//execute the isr handler
}

#pragma vector = EXTI2_vector					//exti 0 interrupt
__interrupt void extic_isr(void) {
//INTERRUPT_HANDLER(extic_isr, EXTI2_vector) {
	//clear the flag
	_isrptr_extic();							//execute the isr handler
}

#pragma vector = EXTI3_vector					//exti 0 interrupt
__interrupt void extid_isr(void) {
//INTERRUPT_HANDLER(extid_isr, EXTI3_vector) {
	//clear the flag
	_isrptr_extid();							//execute the isr handler
}

#pragma vector = EXTI4_vector					//exti 0 interrupt
__interrupt void extie_isr(void) {
//INTERRUPT_HANDLER(extie_isr, EXTI4_vector) {
	//clear the flag
	_isrptr_extie();							//execute the isr handler
}
#endif											//EXTI

//global variables
//for time base off TIM4 @ 256:1 prescaler (TIM4 is 8-bit)
//volatile uint32_t timer1_millis = 0;
volatile uint32_t timer_ticks = 0;							//msw for time base on TIM4
//static uint16_t timer1_fract = 0;
volatile uint32_t SystemCoreClock=16000000ul/8;				//systemcoreclock. defaults to HSI (@16Mhz / 8)

//TIM4 overflow isr
//tim4 isr handler
#pragma vector = TIM4_OVR_UIF_vector		//tim4 overflow interrupt
__interrupt void tim4_ovr_isr(void) {
	TIM4->SR1 &=~(1<<0);					//TIM4_SR_UIF=0;							//clear the flag
	timer_ticks+=0x100ul;					//increase timer_ticks = 8-bit timer/counter + 1:1 prescaler
}

//user-supplied code prototype
extern void setup(void);			//user set-up
extern void loop(void);				//user loop

//define your chips here
//declare pins based on chip packaging

//STM8S pin defs for all packaging
//F: TSSOP20pin - 003F, 103f, 903f
//K: LQFP32pin - 003k, 005k, 103k, 105k, 207k
//S: LQFP44pin - 105s, 207s
//C: LQFP48pin - 005c, 007c, 105c, 207c, 208c
//R: LQFP64pin - 207r, 208r
//M: LQFP80pin - 207m
//
//ALL PINS ARE MAPPED, WHETHER THEY EXIST OR NOT
//SO MAKE SURE THAT THE PINS YOU PICKED ACTUALLY EXIST FOR YOUR PACKAGE
//Pin  0.. 7 -> GPIOA
//Pin  8..15 -> GPIOB
//Pin 16..23 -> GPIOC
//Pin 24..31 -> GPIOD
//Pin 32..39 -> GPIOE
//Pin 40..47 -> GPIOF
//Pin 48..55 -> GPIOG
//Pin 56..63 -> GPIOH
//Pin 64..71 -> GPIOI
const PIN2GPIO GPIO_PinDef[]={
	{GPIOA, 1<<0},						//STM8Sduino Pin  0 = PA0
	{GPIOA, 1<<1},						//GPIOA1 = OSCI
	{GPIOA, 1<<2}, 						//GPIOA2 = OSCO
	{GPIOA, 1<<3},						//STM8Sduino Pin  3 = PA3 TIM2/CH3
	{GPIOA, 1<<4},						//STM8Sduino Pin  4 = PA4
	{GPIOA, 1<<5},						//STM8Sduino Pin  5 = PA5
	{GPIOA, 1<<6},						//STM8Sduino Pin  6 = PA6
	{GPIOA, 1<<7},						//STM8Sduino Pin  7 = PA7
	
	{GPIOB, 1<<0},						//STM8Sduino Pin  8 = PB0 AIN0
	{GPIOB, 1<<1},						//STM8Sduino Pin  9 = PB1 AIN1
	{GPIOB, 1<<2},						//STM8Sduino Pin 10 = PB2 AIN2
	{GPIOB, 1<<3},						//STM8Sduino Pin 11 = PB3 AIN3
	{GPIOB, 1<<4},						//STM8Sduino Pin 12 = PB4 AIN4
	{GPIOB, 1<<5},						//STM8Sduino Pin 13 = PB5 AIN5
	{GPIOB, 1<<6},						//STM8Sduino Pin 14 = PB6 AIN6
	{GPIOB, 1<<7},						//STM8Sduino Pin 15 = PB7 AIN7
	
	{GPIOC, 1<<0},						//STM8Sduino Pin 16 = PC0
	{GPIOC, 1<<1},						//STM8Sduino Pin 17 = PC1 TIM1/CH1
	{GPIOC, 1<<2},						//STM8Sduino Pin 18 = PC2 TIM1/CH2
	{GPIOC, 1<<3},						//STM8Sduino Pin 19 = PC3 TIM1/CH3
	{GPIOC, 1<<4},						//STM8Sduino Pin 20 = PC4 TIM1/CH4
	{GPIOC, 1<<5},						//STM8Sduino Pin 21 = PC5
	{GPIOC, 1<<6},						//STM8Sduino Pin 22 = PC6
	{GPIOC, 1<<7},						//STM8Sduino Pin 23 = PC7
	
	{GPIOD, 1<<0},						//STM8Sduino Pin 24 = PD0 TIM3/CH2
	{GPIOD, 1<<1},						//STM8Sduino Pin 25 = PD1
	{GPIOD, 1<<2},						//STM8Sduino Pin 26 = PD2 TIM3/CH1
	{GPIOD, 1<<3},						//STM8Sduino Pin 27 = PD3 TIM2/CH2
	{GPIOD, 1<<4},						//STM8Sduino Pin 28 = PD4 TIM2/CH1
	{GPIOD, 1<<5},						//STM8Sduino Pin 29 = PD5 
	{GPIOD, 1<<6},						//STM8Sduino Pin 30 = PD6 
	{GPIOD, 1<<7},						//STM8Sduino Pin 31 = PD7
	
	{GPIOE, 1<<0},						//STM8Sduino Pin 32 = PE0
	{GPIOE, 1<<1},						//STM8Sduino Pin 33 = PE1
	{GPIOE, 1<<2},						//STM8Sduino Pin 34 = PE2
	{GPIOE, 1<<3},						//STM8Sduino Pin 35 = PE3
	{GPIOE, 1<<4},						//STM8Sduino Pin 36 = PE4
	{GPIOE, 1<<5},						//STM8Sduino Pin 37 = PE5
	{GPIOE, 1<<6},						//STM8Sduino Pin 38 = PE6 AIN9
	{GPIOE, 1<<7},						//STM8Sduino Pin 39 = PE7 AIN8
	
	{GPIOF, 1<<0},						//STM8Sduino Pin 40 = PF0
	{GPIOF, 1<<1},						//STM8Sduino Pin 41 = PF1
	{GPIOF, 1<<2},						//STM8Sduino Pin 42 = PF2
	{GPIOF, 1<<3},						//STM8Sduino Pin 43 = PF3
	{GPIOF, 1<<4},						//STM8Sduino Pin 44 = PF4 AIN12
	{GPIOF, 1<<5},						//STM8Sduino Pin 45 = PF5
	{GPIOF, 1<<6},						//STM8Sduino Pin 46 = PF6
	{GPIOF, 1<<7},						//STM8Sduino Pin 47 = PF7

#if defined(GPIOG)						//GPIOG not present on all chips
	{GPIOG, 1<<0},						//STM8Sduino Pin 48 = PG0
	{GPIOG, 1<<1},						//STM8Sduino Pin 49 = PG1
	{GPIOG, 1<<2},						//STM8Sduino Pin 50 = PG2
	{GPIOG, 1<<3},						//STM8Sduino Pin 51 = PG3
	{GPIOG, 1<<4},						//STM8Sduino Pin 52 = PG4
	{GPIOG, 1<<5},						//STM8Sduino Pin 53 = PG5
	{GPIOG, 1<<6},						//STM8Sduino Pin 54 = PG6
	{GPIOG, 1<<7},						//STM8Sduino Pin 55 = PG7
#endif

#if defined(GPIOH)						//GPIOH not present on all chips
	{GPIOH, 1<<0},						//STM8Sduino Pin 56 = PH0
	{GPIOH, 1<<1},						//STM8Sduino Pin 57 = PH1
	{GPIOH, 1<<2},						//STM8Sduino Pin 58 = PH2
	{GPIOH, 1<<3},						//STM8Sduino Pin 59 = PH3
	{GPIOH, 1<<4},						//STM8Sduino Pin 60 = PH4
	{GPIOH, 1<<5},						//STM8Sduino Pin 61 = PH5
	{GPIOH, 1<<6},						//STM8Sduino Pin 62 = PH6
	{GPIOH, 1<<7},						//STM8Sduino Pin 63 = PH7
#endif

#if defined(GPIOI)						//GPIOI not present on all chips
	{GPIOI, 1<<0},						//STM8Sduino Pin 64 = PI0
	{GPIOI, 1<<1},						//STM8Sduino Pin 65 = PI1
	{GPIOI, 1<<2},						//STM8Sduino Pin 66 = PI2
	{GPIOI, 1<<3},						//STM8Sduino Pin 67 = PI3
	{GPIOI, 1<<4},						//STM8Sduino Pin 68 = PI4
	{GPIOI, 1<<5},						//STM8Sduino Pin 69 = PI5
	{GPIOI, 1<<6},						//STM8Sduino Pin 70 = PI6
	{GPIOI, 1<<7},						//STM8Sduino Pin 71 = PI7
#endif
};

//configure clock
//use hsi oscillator
void SystemCoreClockHSI(uint8_t CLK_HSIDIV) {
   /* check the parameters */
    //assert_param(IS_CLK_PRESCALER_OK(CLK_HSIDIV));
	
