dannyf00/STM8Sduino/stm8sduino.c
	//CLK_DeInit();
	CLK->ICKR |= CLK_ICKR_HSIEN;					//enable HSI
	while ((CLK->ICKR & CLK_ICKR_HSIRDY) == 0) continue;	//wait until HSI is ready
	CLK->SWCR|= CLK_SWCR_SWEN;						//start the switch
	CLK->SWR = 0xe1;								//0xe1->HSI, 0xd2->LSI, 0xb4->HSE	//CLK_HSICmd(ENABLE);
	while ((CLK->SWCR & CLK_SWCR_SWBSY) == 1) continue;	//wait until the busy signal is no more	//while(SET != CLK_GetFlagStatus(CLK_FLAG_HSIRDY)) continue;	//make sure hsi is ready
	CLK->CKDIVR = (CLK->CKDIVR &~CLK_CKDIVR_HSIDIV) | (CLK_HSIDIV & CLK_CKDIVR_HSIDIV);	//set hsi divider
	CLK->CKDIVR = (CLK->CKDIVR &~CLK_CKDIVR_CPUDIV) | (CLK_PRESCALER_CPUDIV1& CLK_CKDIVR_CPUDIV);	//set cpu divier -> default to 1:1
	//update SystemCoreClock
	switch (CLK_HSIDIV) {
		case CLK_PRESCALER_HSIDIV1: SystemCoreClock = HSI_VALUE / 1; break;
		case CLK_PRESCALER_HSIDIV2: SystemCoreClock = HSI_VALUE / 2; break;
		case CLK_PRESCALER_HSIDIV4: SystemCoreClock = HSI_VALUE / 4; break;
		case CLK_PRESCALER_HSIDIV8: SystemCoreClock = HSI_VALUE / 8; break;
		default: SystemCoreClock = HSI_VALUE / 8; break;
	}
}

//use hse oscillator
void SystemCoreClockHSE(void) {
   /* check the parameters */
    //assert_param(IS_CLK_PRESCALER_OK(CLK_HSIDIV));
	
	//CLK_DeInit();
	CLK->ECKR |= CLK_ECKR_HSEEN;					//enable HSE
	while ((CLK->ECKR & CLK_ECKR_HSERDY) == 0) continue;	//wait until HSE is ready
	CLK->SWCR|= CLK_SWCR_SWEN;						//start the switch
	CLK->SWR = 0xb4;								//0xe1->HSI, 0xd2->LSI, 0xb4->HSE	//CLK_HSICmd(ENABLE);
	while ((CLK->SWCR & CLK_SWCR_SWBSY) == 1) continue;	//wait until the busy signal is no more	//while(SET != CLK_GetFlagStatus(CLK_FLAG_HSIRDY)) continue;	//make sure hsi is ready
	//update SystemCoreClock
	SystemCoreClock = HSE_VALUE;
}

//Arduino Functions: GPIO
//set a pin mode to INPUT, INPUT_PULLUP, INPUT_PULLDN or OUTPUT
//no error checking on PIN
inline void pinMode(PIN_TypeDef pin, uint8_t mode) {
	//if (mode==INPUT) GIO_IN(GPIO_PinDef[pin].gpio, GPIO_PinDef[pin].mask);
	//else GIO_OUT(GPIO_PinDef[pin].gpio, GPIO_PinDef[pin].mask);
	switch (mode) {
	case OUTPUT_OD: 	GIO_OUTOD(GPIO_PinDef[pin].gpio, GPIO_PinDef[pin].mask); break;
	case OUTPUT: 		GIO_OUT(GPIO_PinDef[pin].gpio, GPIO_PinDef[pin].mask); break;
	case INPUT_PULLUP: 	GIO_INPU(GPIO_PinDef[pin].gpio, GPIO_PinDef[pin].mask); break;
	case INPUT:
	default: 			GIO_INFL(GPIO_PinDef[pin].gpio, GPIO_PinDef[pin].mask); break;
	}
}

//set / clear a pin
inline void digitalWrite(PIN_TypeDef pin, uint8_t val) {
	if (val==LOW) GIO_CLR(GPIO_PinDef[pin].gpio, GPIO_PinDef[pin].mask);
	else GIO_SET(GPIO_PinDef[pin].gpio, GPIO_PinDef[pin].mask);
}

//read a pin
inline int digitalRead(PIN_TypeDef pin) {
	return (GIO_GET(GPIO_PinDef[pin].gpio, GPIO_PinDef[pin].mask))?HIGH:LOW;
}
//end GPIO

//Arduino Functions: Time
//return time base ticks
uint32_t ticks(void) {
	uint32_t m;
	uint8_t f;
	
	//use double reads
	do {
		m = timer_ticks;
		f = TIM4->CNTR;
	} while (m != timer_ticks);
		
	//return ((((uint32_t) m << 16) | (f << 8)) >> 10) / 2 / clockCyclesPerMicrosecond();		//128:1 prescaler
	return (m | f) << TIM4_PS;
}

//return microseconds
uint32_t micros(void) {
	uint32_t m;					//stores overflow count
	uint8_t f;					//return the fractions / TIM4 8-bit value
	
	//use double reads
	do {
		m = timer_ticks;
		f = TIM4->CNTR;
	} while (m != timer_ticks);
	//now m and f are consistent
	return ((m | f) / clockCyclesPerMicrosecond()) << TIM4_PS;						//2^TIM4_PS:1 prescaler
}
	
//return milliseconds
uint32_t millis(void) {
	uint32_t m;
	uint8_t f;
	
	//use double reads
	do {
		m = timer_ticks;
		f = TIM4->CNTR;
	} while (m != timer_ticks);

	return (((m | f) / clockCyclesPerMicrosecond()) << TIM4_PS) / 1000;
}

//delay millisseconds
void delay(uint32_t ms) {
#if 0												//using millis()
	uint32_t start_time = millis();

	while (millis() - start_time < ms) continue;
#else												//using ticks()
	uint32_t start_time = ticks();
	
	ms *= (SystemCoreClock / 1000);					//convert ms to ticks
	while (ticks() - start_time < ms) continue;
#endif
}

//delay micros seconds
void delayMicroseconds(uint32_t us) {
#if 0												//using micros()
	uint32_t start_time = micros();
	
	while (micros() - start_time < us) continue;
#else												//using ticks()
	uint32_t start_time = ticks();
	
	us *= (SystemCoreClock / 1000000ul);			//convert us to ticks
	while (ticks() - start_time < us) continue;
#endif
}
//end Time


//Arduino Functions: Advanced IO
//shift in - from arduino code base / not optimized
uint8_t shiftIn(PIN_TypeDef dataPin, PIN_TypeDef clockPin, uint8_t bitOrder) {
	uint8_t value = 0;
	uint8_t i;

	for (i = 0; i < 8; ++i) {
		digitalWrite(clockPin, HIGH);
		if (bitOrder == LSBFIRST)
			value |= digitalRead(dataPin) << i;
		else
			value |= digitalRead(dataPin) << (7 - i);
		digitalWrite(clockPin, LOW);
	}
	return value;
}

//shift out - from arduino code base / not optimized
void shiftOut(PIN_TypeDef dataPin, PIN_TypeDef clockPin, uint8_t bitOrder, uint8_t val) {
	uint8_t i;

	for (i = 0; i < 8; i++)  {
		if (bitOrder == LSBFIRST)
			digitalWrite(dataPin, !!(val & (1 << i)));
		else	
			digitalWrite(dataPin, !!(val & (1 << (7 - i))));
			
		digitalWrite(clockPin, HIGH);
		digitalWrite(clockPin, LOW);		
	}
}

//wait for a pulse and return timing
uint32_t pulseIn(PIN_TypeDef pin, uint8_t state) {
	uint32_t tmp;
	state = (state == LOW)?LOW:HIGH;				
	while (digitalRead(pin) == state) continue;		//wait for the pin to opposite
	//now pin is _state
	tmp = micros();
	state = (state == LOW)?HIGH:LOW;				//calculate the state to end the wait
	while (digitalRead(pin) == state) continue;		//wait for the pin to go back to its original state
	tmp = micros() - tmp;							//calculate the pulse width
	return tmp;
}
//end Advanced IO

//pwm output - not implemented yet
//top at PWMOUT_PR -> max 16-bit pwm output
void analogWrite(PIN_TypeDef pin, uint16_t dc) {
	//bound dc range
	dc = (dc > PWM_PR)?PWM_PR:dc;				//limit the range
	switch (pin) {
#if defined(TIM1) && defined(USE_PWM1)
	//tim1 ch1/2/3/4
	case PC1/*17*/:								//pin 17 -> PC1/TIM1CH1
		//load the duty cycle
		TIM1->CCR1H = dc>>8;
		TIM1->CCR1L = dc;
		TIM1->CCER1|= 1<<0;						//1->enable OCi output, 0->disable OCi output
		break;
	case PC2/*18*/:								//pin 18 -> PC2/TIM1CH2
		//load the duty cycle
		TIM1->CCR2H = dc>>8;
		TIM1->CCR2L = dc;
		TIM1->CCER1|= 1<<4;						//1->enable OCi output, 0->disable OCi output
		break;
	case PC3/*19*/:								//pin 19 -> PC3/TIM1CH3
		//load the duty cycle
		TIM1->CCR3H = dc>>8;
		TIM1->CCR3L = dc;
		TIM1->CCER2|= 1<<0;						//1->enable OCi output, 0->disable OCi output
		break;
	case PC4/*20*/:								//pin 20 -> PC4/TIM1CH4
		//load the duty cycle
		TIM1->CCR4H = dc>>8;
		TIM1->CCR4L = dc;
		TIM1->CCER2|= 1<<4;						//1->enable OCi output, 0->disable OCi output
		break;
#endif
#if defined(TIM2) && defined(USE_PWM2)			//3x pwm
	//TIM2 ch1/2/3
	case PD4/*28*/: 							//pin 28 -> PD4/TIM2CH1
		//load the duty cycle
		TIM2->CCR1H = dc>>8;
		TIM2->CCR1L = dc;
		TIM2->CCER1|= 1<<0;						//1->enable OCi output, 0->disable OCi output
		break;
	case PD3/*27*/: 							//pin 27 -> PD3/TIM2CH2
		//load the duty cycle
		TIM2->CCR2H = dc>>8;
		TIM2->CCR2L = dc;
		TIM2->CCER1|= 1<<4;						//1->enable OCi output, 0->disable OCi output
		break;
	case PA3/*3*/:								//pin  3 -> PA3/TIM2CH3
		//load the duty cycle
		TIM2->CCR3H = dc>>8;
		TIM2->CCR3L = dc;
		TIM2->CCER2|= 1<<0;						//1->enable OCi output, 0->disable OCi output
		break;
#endif
#if defined(TIM3) && defined(USE_PWM3)			//2ch pwm
	//TIM3 ch1/2
	case PD2/*26*/:								//pin 26 -> PD2/TIM3CH1
		//load the duty cycle
		TIM3->CCR1H = dc>>8;
		TIM3->CCR1L = dc;
		TIM3->CCER1|= 1<<0;						//1->enable OCi output, 0->disable OCi output
		break;
	case PD0/*24*/: 							//pin 24 -> PD0/TIM3CH2
		//load the duty cycle
		TIM3->CCR2H = dc>>8;
		TIM3->CCR2L = dc;
		TIM3->CCER1|= 1<<4;						//1->enable OCi output, 0->disable OCi output
		break;
#endif
	default: 	break; 							//do nothing
	}
}

#if defined(USE_ADC1)
//analog read on ADC1
//read DRL first for right aligned results
//user responsible for configuring ain to a gpio pin
uint16_t analogRead(AIN_TypeDef ain) {
	uint16_t tmp;
	ADC1->CSR = (ADC1->CSR &~0x0f) | (ain & 0x0f);	//set the channel
	//ADC1->CR1|= (1<<0);							//start the conversion
	ADC1->CR1|= (1<<0);								//start the conversion
	while ((ADC1->CSR & (1<<7)) == 0) continue;		//wait for the previous conversion to end (EOC = 1 if conversion is complete)
	//read the adc results
	tmp = ADC1->DRL;								//read DRL first for right aligned results
	tmp|= ADC1->DRH << 8;
	ADC1->CSR &=~(1<<7);							//clear the EOC
	//ADC1->CR1&=~(1<<0);							//power down adc
	return tmp;
}

//change analog reference - not applicable on STM8S
#define analogReference(x)
#endif												//ADC1

//beep functions
//user needs to configure tone pin as output - see datasheet
void tone(void) {
	BEEP->CSR |= (1<<5);							//'1'->turn on tone, '0'->turn off tone
}

