dannyf00/STM8Sduino/stm8sduino.c
void noTone(void) {
	BEEP->CSR &=~(1<<5);							//'1'->turn on tone, '0'->turn off tone
}

#if defined(USE_EXTI)
//activate interrupt
//mode: RISING, FALLING and CHANGE
void attachInterrupt(PIN_TypeDef pin, void (*isrptr)(void), uint8_t mode){
	//convert arduino modes to EXTI modes
	switch (mode) {
	case RISING: 	mode = 0x01; break;			//rising edge triggered
	case CHANGE: 	mode = 0x03; break;			//change triggered
	case FALLING: 	
	default: 		mode = 0x02; break;			//default is falling edge triggered
	}
	
	//disable global interrupt first before changing EXTI->CRn registers
	noInterrupts();
	
	//configure EXTI_CR1/CR2 registers
	if (GPIO_PinDef[pin].gpio==GPIOA) {			//configure interrupt on porta
		_isrptr_extia = isrptr;					//install user handler
		EXTI->CR1 = (EXTI->CR1 &~EXTI_CR1_PAIS) | ((mode << 0) & EXTI_CR1_PAIS);
	}

	if (GPIO_PinDef[pin].gpio==GPIOB) {			//configure interrupt on portb
		_isrptr_extib = isrptr;					//install user handler
		EXTI->CR1 = (EXTI->CR1 &~EXTI_CR1_PBIS) | ((mode << 2) & EXTI_CR1_PBIS);
	}
	
	if (GPIO_PinDef[pin].gpio==GPIOC) {			//configure interrupt on portc
		_isrptr_extic = isrptr;					//install user handler
		EXTI->CR1 = (EXTI->CR1 &~EXTI_CR1_PCIS) | ((mode << 4) & EXTI_CR1_PCIS);
	}
	
	if (GPIO_PinDef[pin].gpio==GPIOD) {			//configure interrupt on portd
		_isrptr_extid = isrptr;					//install user handler
		EXTI->CR1 = (EXTI->CR1 &~EXTI_CR1_PDIS) | ((mode << 6) & EXTI_CR1_PDIS);
	}
	
	if (GPIO_PinDef[pin].gpio==GPIOE) {			//configure interrupt on porte
		_isrptr_extie = isrptr;					//install user handler
		EXTI->CR2 = (EXTI->CR2 &~EXTI_CR2_PEIS) | ((mode << 0) & EXTI_CR2_PEIS);
	}

	//enable global interrupt
	interrupts();	

	//configure gpio pin, with interrupt capability by setting CR2
	GPIO_PinDef[pin].gpio->CR2 |= GPIO_PinDef[pin].mask;
	
}

//deactivate interrupt
//pin revert back to input, floating mode
void detachInterrupt(PIN_TypeDef pin){
	uint8_t mode = 0x00;						//falling and low -> default state
	void (*isrptr)(void) = empty_handler;		//reset handler to empty_handler. for ease of coding
	
	//convert arduino modes to EXTI modes
	//switch (mode) {
	//case RISING: 	mode = 0x01; break;			//rising edge triggered
	//case CHANGE: 	mode = 0x03; break;			//change triggered
	//case FALLING: 
	//default: 		mode = 0x02; break;			//default is falling edge triggered
	//}
	
	//configure EXTI_CR1/CR2 registers
	if (GPIO_PinDef[pin].gpio==GPIOA) {			//configure interrupt on porta
		_isrptr_extia = isrptr;					//install user handler
		EXTI->CR1 = (EXTI->CR1 &~EXTI_CR1_PAIS) | ((mode << 0) & EXTI_CR1_PAIS);
	}

	if (GPIO_PinDef[pin].gpio==GPIOB) {			//configure interrupt on portb
		_isrptr_extib = isrptr;					//install user handler
		//EXTI->CR1 = (EXTI->CR1 &~EXTI_CR1_PBIS) | ((mode << 2) & EXTI_CR1_PBIS);
	}
	
	if (GPIO_PinDef[pin].gpio==GPIOC) {			//configure interrupt on portc
		_isrptr_extic = isrptr;					//install user handler
		//EXTI->CR1 = (EXTI->CR1 &~EXTI_CR1_PCIS) | ((mode << 4) & EXTI_CR1_PCIS);
	}
	
	if (GPIO_PinDef[pin].gpio==GPIOD) {			//configure interrupt on portd
		_isrptr_extid = isrptr;					//install user handler
		//EXTI->CR1 = (EXTI->CR1 &~EXTI_CR1_PDIS) | ((mode << 6) & EXTI_CR1_PDIS);
	}
	
	if (GPIO_PinDef[pin].gpio==GPIOE) {			//configure interrupt on porte
		_isrptr_extie = isrptr;					//install user handler
		//EXTI->CR2 = (EXTI->CR2 &~EXTI_CR2_PEIS) | ((mode << 0) & EXTI_CR2_PEIS);
	}

	//disable pin interrupt capability by clear CR2
	GPIO_PinDef[pin].gpio->CR2 &=~GPIO_PinDef[pin].mask;
}
#endif										//exti

//uart1 routines
#if defined(UART1) && defined(USE_UART1)
//configure uart1 -> similar configurations among UART1/2/3/4
//UART1: TX on PA2, RX on PA3
void serial1Begin(uint32_t BaudRate) {
	//route clock to uart2
	CLK->PCKENR1 |= CLK_PCKENR1_UART1;		//'1'=clock enabled, '0'=clock disabled

  	//user to configure TXpin (PD5) as output through serialBegin()
	//user to configure RXpin (PD6) as input through serialBegin()
	//configure UART2 RX (on PD6)
	
	//configure UART2 TX: 8-bit, 1-stop bit, no parity, syncmode disable
	UART1->CR1 |= (1<<5);					//'1'->disable uart, '0'->enable uart transmitter

	uint16_t tmp = SystemCoreClock / BaudRate;			//max of 16-bit
	//set BRR2 first, per the datasheet
	UART1->BRR2 = ((tmp >> 8) & 0xf0) | (tmp & 0x0f);	//BRR2 is the top 4 + bottom 4 digits
	UART1->BRR1 = tmp >> 4;								//BRR1 is the middle 4 digits
	
	UART1->CR5 = 0;							//default value
	UART1->CR4 = 	(0<<6) |				//'0'->LIN break detection interrupt disabled, '1'->enabled
					(0<<5) |				//'0'->10-bit line detection, '1'->11-bit line detection
					(0<<4) |				//'0'->line break not detected, '1'->line break detected
					(0<<0) |				//4-bit Address of the UART note
					0x00;
	UART1->CR3 = 	(0<<6) |				//'0'->disable LIN, '1'->enable LIN
					(0<<4) |				//0->1 stop bit, 1->reserved, 2->2 stop bit, 3->1.5 stop bit
					(0<<3) |				//'0'->disable SCK, '1'->enable SCK
					(0<<2) |				//'0'->SCK idles low, '1'->SCK idles high
					(0<<1) |				//'0'->capture data on first clock transition, '1'->capture data on 2nd clock transition
					(0<<0) |				//'0'->last clock pulse is not output, '1'->last clock pulse is on output
					0x00;
	UART1->CR2 =	(0<<7) |				//'0'->tx interrupt disabled, '1'->tx interrupt enabled
					(0<<6) |				//'0'->tx completion interrupt diabled, '1'->tx completion interrupt enabled
					(0<<5) |				//'0'->rx interrupt disabled, '1'->rx interrupt enabled
					(0<<4) |				//'0'->idle line interrupt disabled, '1'->idle line interrupt enabled
					(1<<3) |				//'0'->tx disabled, '1'->tx enabled
					(1<<2) |				//'0'->rx disabled, '1'->rx enabled
					(0<<1) |				//'0'->receiver in active mode, '1'->receiver in mute mode
					(0<<0) |				//'0'->don't send break; '1'->send break;
					0x00;
	UART1->CR1 = 	(0<<7) |				//9th bit for receiving in 9-bit mode (when M=1)
					(0<<6) |				//9th bit for transmission in 9-bit mode (when M=1)
					(0<<5) |				//'0'->uart enabled, '1'->uart disabled
					(0<<4) |				//'0'->1start bit, 8 data bits, n stop bits; '1'->1 start bit, 9 data bits, 1 stop bit
					(0<<3) |				//'0'->idle line, '1'->address line wakes up uart
					(0<<2) |				//'0'->parity disabled, '1'->parity enabled
					(0<<1) |				//'0'->even partity, '1'->odd parity
					(0<<0) |				//'0'->parity interrupt disabled, '1'->parity interrupt enabled
					0x00;
	//configure interrupt -> if uart2 to be interrupt-driven
	
