dannyf00/STM8Sduino/stm8sduino.c
	//enable UART1
	UART1->CR1 &=~(1<<5);					//'0'->enable uart, '1'->disable uart
	
}

//uart1 send a char
void serial1Write(unsigned char dat) {
    UART1->DR = dat;                        //load the data buffer
    while (!(UART1->SR & UART1_SR_TC));    	//wait for the transmission to complete
}

//uart1 returns a char
unsigned char serial1Read(void) {
    while (!(UART1->SR & UART1_SR_RXNE));  	//wait fo the receipt to terminate
    return UART1->DR;                       //save the transmission buffer
}

//uart1 print a string
void serial1Print(unsigned char *str) {
	do {
		while (!(UART1->SR & UART1_SR_TXE));	//wait for the transmission buffer to empty
		UART1->DR = *str++;					//load the data into transmission buffer
	} while (*str);
}

//uart1 print a string + return
void serial1Println(unsigned char *str) {
	serial1Print(str);						//print the string
	serial1Print("\n\r");					//print the return
}

//test if uart1 is available
//return true if transmission on uart1 has completed
uint8_t serial1Available(void) {
	return (UART1->SR & UART1_SR_TC)?true:false;
}
#endif											//use_uart1

#if defined(USE_UART2) && defined(UART2)		//005, 105
//configure uart2 -> similar configurations among UART1/2/3/4
//UART2: TX on PD5, RX on PD6
void serial2Begin(uint32_t BaudRate) {
	//route clock to uart2
	CLK->PCKENR1 |= CLK_PCKENR1_UART2;		//'1'=clock enabled, '0'=clock disabled

  	//user to configure TXpin (PD5) as output through serialBegin()
	//user to configure RXpin (PD6) as input through serialBegin()
	//configure UART2 RX (on PD6)
	
	//configure UART2 TX: 8-bit, 1-stop bit, no parity, syncmode disable
	UART2->CR1 |= (1<<5);					//'1'->disable uart, '0'->enable uart transmitter

	uint16_t tmp = SystemCoreClock / BaudRate;			//max of 16-bit
	//set BRR2 first, per the datasheet
	UART2->BRR2 = ((tmp >> 8) & 0xf0) | (tmp & 0x0f);	//BRR2 is the top 4 + bottom 4 digits
	UART2->BRR1 = tmp >> 4;								//BRR1 is the middle 4 digits
	
	UART2->CR1 = 	(0<<7) |				//9th bit for receiving in 9-bit mode (when M=1)
					(0<<6) |				//9th bit for transmission in 9-bit mode (when M=1)
					(0<<5) |				//'0'->uart enabled, '1'->uart disabled
					(0<<4) |				//'0'->1start bit, 8 data bits, n stop bits; '1'->1 start bit, 9 data bits, 1 stop bit
					(0<<3) |				//'0'->idle line, '1'->address line wakes up uart
					(0<<2) |				//'0'->parity disabled, '1'->parity enabled
					(0<<1) |				//'0'->even partity, '1'->odd parity
					(0<<0) |				//'0'->parity interrupt disabled, '1'->parity interrupt enabled
					0x00;
	UART2->CR2 =	(0<<7) |				//'0'->tx interrupt disabled, '1'->tx interrupt enabled
					(0<<6) |				//'0'->tx completion interrupt diabled, '1'->tx completion interrupt enabled
					(0<<5) |				//'0'->rx interrupt disabled, '1'->rx interrupt enabled
					(0<<4) |				//'0'->idle line interrupt disabled, '1'->idle line interrupt enabled
					(1<<3) |				//'0'->tx disabled, '1'->tx enabled
					(1<<2) |				//'0'->rx disabled, '1'->rx enabled
					(0<<1) |				//'0'->receiver in active mode, '1'->receiver in mute mode
					(0<<0) |				//'0'->don't send break; '1'->send break;
					0x00;
	UART2->CR3 = 	(0<<6) |				//'0'->disable LIN, '1'->enable LIN
					(0<<4) |				//0->1 stop bit, 1->reserved, 2->2 stop bit, 3->1.5 stop bit
					(0<<3) |				//'0'->disable SCK, '1'->enable SCK
					(0<<2) |				//'0'->SCK idles low, '1'->SCK idles high
					(0<<1) |				//'0'->capture data on first clock transition, '1'->capture data on 2nd clock transition
					(0<<0) |				//'0'->last clock pulse is not output, '1'->last clock pulse is on output
					0x00;
	UART2->CR4 = 	(0<<6) |				//'0'->LIN break detection interrupt disabled, '1'->enabled
					(0<<5) |				//'0'->10-bit line detection, '1'->11-bit line detection
					(0<<4) |				//'0'->line break not detected, '1'->line break detected
					(0<<0) |				//4-bit Address of the UART note
					0x00;
	UART2->CR5 = 0;							//default value
	//configure interrupt -> if uart2 to be interrupt-driven
	
	//enable UART2
	UART2->CR1 &=~(1<<5);					//'0'->enable uart, '1'->disable uart
	
}

//uart2 send a char
void serial2Write(unsigned char dat) {
    UART2->DR = dat;                        //load the data buffer
    while (!(UART2->SR & UART2_SR_TC));    	//wait for the transmission to complete
}

//uart2 returns a char
unsigned char serial2Read(void) {
    while (!(UART2->SR & UART2_SR_RXNE));  	//wait fo the receipt to terminate
    return UART2->DR;                       //save the transmission buffer
}

//uart2 print a string
void serial2Print(unsigned char *str) {
	do {
		while (!(UART2->SR & UART2_SR_TXE));	//wait for the transmission buffer to empty
		UART2->DR = *str++;					//load the data into transmission buffer
	} while (*str);
}

//uart2 print a string + return
void serial2Println(unsigned char *str) {
	serial2Print(str);						//print the string
	serial2Print("\n\r");					//print the return
}

//test if uart2 is available
//return true if transmission on uart2 has completed
uint8_t serial2Available(void) {
	return (UART2->SR & UART2_SR_TC)?true:false;
}
#endif											//use_uart2

#if defined(USE_SPI)
//send char via hardware spi
//MISO on PC7, MOSI on PC6, SCK on PC5
//Order = LSBFIRST or MSBFIRST
uint8_t SPIWrite(uint8_t order, uint8_t dat) {
    if (order == LSBFIRST) SPI->CR1 |= (1<<7);  //'1'->LSB first
    else SPI->CR1 &=~(1<<7);                    //'0'->MSB first
    while ((SPI->SR & (1<<1))==0) continue;      //wait for transmit buffer to be empty (bit 1 goes to 1)
    SPI->DR = dat;                          	//load the transmission buffer -> transmission starts. this approach can be risk for reads
    //consider test busy signal
    while (SPI->SR & SPI_SR_BSY) continue;      //'1'->SPI is buy, '0'->SPI is not busy
    //comment the above line for higher throughput if you don't care about the read-back
    return SPI->DR;                         	//return spi data buffer
}

//buffer write of a string
uint8_t SPIWrites(uint8_t order, uint8_t *dat, uint16_t length) {
    if (order == LSBFIRST) SPI->CR1 |= (1<<7);  //'1'->LSB first
    else SPI->CR1 &=~(1<<7);                    //'0'->MSB first
	while (length--) {
		while ((SPI->SR & (1<<1))==0) continue;      //wait for transmit buffer to be empty (bit 1 goes to 1)
    	SPI->DR = *dat++;                          	//load the transmission buffer -> transmission starts. this approach can be risk for reads
	}
    //consider test busy signal
    while (SPI->SR & SPI_SR_BSY) continue;      //'1'->SPI is buy, '0'->SPI is not busy
    //comment the above line for higher throughput if you don't care about the read-back
    return SPI->DR;                         	//return spi data buffer
}

//read spi
//MISO on PC7, MOSI on PC6, SCK on PC5
//Order = LSBFIRST or MSBFIRST
uint8_t SPIRead(uint8_t order) {
    //uint8_t tmp;
    if (order == LSBFIRST) SPI->CR1 |= (1<<7);  //'1'->LSB first
    else SPI->CR1 &=~(1<<7);                    //'0'->MSB first
    while ((SPI->SR & (1<<1))==0) continue;      //wait for transmit buffer to be empty (bit 1 goes to 1)
    SPI->DR = /*dat*/0x00;                      //load the transmission buffer -> transmission starts. this approach can be risk for reads
    //consider test busy signal
    while (SPI->SR & SPI_SR_BSY) continue;      //'1'->SPI is buy, '0'->SPI is not busy
    //comment the above line for higher throughput if you don't care about the read-back
    return SPI->DR;                         	//return spi data buffer
}
#endif											//spi

