dannyf00/STM8Sduino/stm8sduino.c
#if defined(USE_I2C) 
//send a start condition
void I2CStart(void) {
    I2C->CR2 |= (1<<0);							//'1'->send a start condition
    while (!(I2C->SR1 & (1<<0)));				//'1'->start bit generated
	(void)I2C->SR1;								//clear the start condition by reading I2C->SR1 followed by a write to I2C->DR
}
//send a stop condition
void I2CStop() {
    I2C->CR2 |= (1<<1);							//'1'->send a stop condition
    while (!(I2C->SR3 & (1<<0)));				//'1'->stop condition is detected on the bus
}

//write address
void I2CWriteaddr(uint8_t addr) {
    I2C->DR = addr;
    while (!(I2C->SR1 & (1<<1)));				//'1'->address sent, '0'->address not yet sent
    (void) I2C->SR1;							//clear EV6 -> see datasheet
	(void) I2C->SR3;
    I2C->CR2 |= (1<<2);							//send the ack
}

//send data
void I2CWrite(uint8_t dat) {
    I2C->DR = dat;								//load data
    while (!(I2C->SR1 & (1<<7)));				//'1' when transmission buffer is empty. not set in address phase
}

//read i2c
uint8_t I2CRead(uint8_t ack) {
    if (ack)
        I2C->CR2 |= (1<<2);						//'1'->send ack
    else
        I2C->CR2 &= ~(1<<2);						//'0'->don't send ack
    while (!(I2C->SR1 & (1<<6)));				//'0'->receiver buffer is empty, '1'->receiver buffer is not empty
    return I2C->DR;
}	

#endif											//i2c

//initialize the mcu
//reset the mcu
void mcu_init(void){
	//configure clock sources
	//SystemCoreClockHSE();								//set clock to hse, @ HSE_VALUE
	//SystemCoreClockHSI_16MHz();							//set clock to hsi, _2MHz, _4MHz, _8MHz, _16MHz
	SystemCoreClockHSI_2MHz();						//default setting: set clock to hsi, _2MHz, _4MHz, _8MHz, _16MHz

	//disable all peripherals by default
	CLK->PCKENR1 = CLK->PCKENR2 = 0x00;		//'0'->disable clock to a peripheral, '1'->enable clock
	
	//configure time base for micros/millis on TIM4 (or TIM2 if TIME4 isn't available)
	timer_ticks = 0;						//reset timer ticks
	//enable the clock to peripheral
	//TIM4 running at 2^TIM4_PS prescaler
	CLK->PCKENR1 |= CLK_PCKENR1_TIM4;					//'1'=clock enabled, '0'=clock disabled
	//set up the time base
	//stop the timer
	//TIM4->CR1 &=~(1<<0);					//stop the timer
	//set up the timer
	TIM4->CR1 = (1<<7) |					//'1'->enable auto reload buffer
	  			(0<<5) |					//'0'->edge aligned. 1..3->center aligned
				(0<<4) |					//'0'->up counter, '1' downcounter
				(0<<3) |					//'0'->continuous mode, '1'->one pulse mode
				(0<<2) |					//'0'-> update enable source
				(0<<1) |					//'0'-> update enabled
				(0<<0);						//counter disabled
	//TIMx->CR2 = 0;							//default value
	//TIMx->SMCR = 0;							//default value
	//TIMx->ETR = 0;							//'0'->external trigger not inverted
	TIM4->PSCR = (TIM4_PS) & 0x07;			//3-bit prescaler = 2^0x00 = 1:1
	TIM4->CNTR = 0; 						//TIMx->CNTRL = 0;			//reset the counter
	TIM4->ARR = 0xff;						//top at 256				//pr = pr - 1; TIMx->ARR = pr;			//load up the auto reload register - msb first
	TIM4->SR1&=~(1<<0);						//clear UIF
	TIM4->IER|= (1<<0);						//'1'->enable overflow interrupt, '0'->disable interrupt
	//re-enable the counter
	TIM4->CR1 |= (1<<0);	
	
	//configure pwm time base - not yet implemented
	//enable the clock to TIM1
	CLK->PCKENR1 |= CLK_PCKENR1_TIM1;		//'1'=clock enabled, '0'=clock disabled
	TIM1->CR1 = (1<<7) |					//'1'->enable auto reload buffer
	  			(1<<5) |					//'0'->edge aligned. 1..3->center aligned
				(0<<4) |					//'0'->up counter, '1' downcounter
				(0<<3) |					//'0'->continuous mode, '1'->one pulse mode
				(0<<2) |					//'0'-> update enable source
				(0<<1) |					//'0'-> update enabled
				(0<<0);						//counter disabled
	TIM1->CR2 = 0;							//reset value
	TIM1->PSCRH = (1ul<<(PWMOUT_PS)-1)>>8;
	TIM1->PSCRL = (1ul<<(PWMOUT_PS)-1);		//prescaler = 1:1. map'd to 3-bit prescaler to be compatible with tim2/3
	TIM1->CNTRH = TIM1->CNTRL = 0;			//reset the counter
	TIM1->ARRH = (PWM_PR)>>8; 
	TIM1->ARRL = (PWM_PR);					//top at 0x0fff
	TIM1->SR1 &=~(1<<0);					//clear uif
	TIM1->CR1 |= (1<<0);					//start the timer

#if defined(TIM1) && defined(USE_PWM1)
	//configure TIM1/OC1/2/3/4 -> output disabled
	TIM1->CCMR1 = 	(7<<4) |				//0b110->PWM mode 1, 0b111->PWM mode 2
					(0<<3) |				//'0'->OCiPE disabled, '1'->OCiPE enabled
					(0<<0);					//0b00->OCi as output
	TIM1->CCMR4 = TIM1->CCMR3 = TIM1->CCMR2 = TIM1->CCMR1;
	TIM1->CCER1 = 	(0<<5) |				//OC2: 0->active high, 1->active low
					(0<<4) |				//OC2: 1->enable OC2, 0->disable OC2
					(0<<1) |				//OC1: 0->active high, 1->active low
					(0<<0) |				//OC1: 1->enable OC2, 0->disable OC2
					0x00;
	//check CCER2 for OC3 settings
	TIM1->CCER2 = 	(0<<5) |				//OC4: 0->active high, 1->active low
					(0<<4) |				//OC4: 1->enable OC2, 0->disable OC2
					(0<<1) |				//OC3: 0->active high, 1->active low
					(0<<0) |				//OC3: 1->enable OC2, 0->disable OC2
					0x00;
#endif										//tim1

#if defined(TIM2) && defined(USE_PWM2)
	//enable the clock to TIM2
	CLK->PCKENR1 |= CLK_PCKENR1_TIM2;					//'1'=clock enabled, '0'=clock disabled
	TIM2->CR1 = (1<<7) |					//'1'->enable auto reload buffer
	  			//(1<<5) |					//'0'->edge aligned. 1..3->center aligned
				//(0<<4) |					//'0'->up counter, '1' downcounter
				(0<<3) |					//'0'->continuous mode, '1'->one pulse mode
				(0<<2) |					//'0'-> update enable source
				(0<<1) |					//'0'-> update enabled
				(0<<0);						//counter disabled
	TIM2->PSCR = (PWMOUT_PS) & 0x0f;			//4-bit prescaler, valid range [0..15], 2^PSCR divider, 0 = 1:1.
	TIM2->CNTRH = TIM1->CNTRL = 0;			//reset the counter
	TIM2->ARRH = (PWM_PR)>>8; 
	TIM2->ARRL = (PWM_PR);					//top at 0x0fff
	TIM2->SR1 &=~(1<<0);					//clear uif
	TIM2->CR1 |= (1<<0);					//start the timer
	
	//configure TIM2/OC1/2/3 -> output disabled
	TIM2->CCMR1 = 	(7<<4) |				//0b110->PWM mode 1, 0b111->PWM mode 2
					(0<<3) |				//'0'->OCiPE disabled, '1'->OCiPE enabled
					(0<<0);					//0b00->OCi as output
	TIM2->CCMR3 = TIM2->CCMR2 = TIM2->CCMR1;
	TIM2->CCER1 = 	(0<<5) |				//OC2: 0->active high, 1->active low
					(0<<4) |				//OC2: 1->enable OC2, 0->disable OC2
					(0<<1) |				//OC1: 0->active high, 1->active low
					(0<<0) |				//OC1: 1->enable OC2, 0->disable OC2
					0x00;
	//check CCER2 for OC3 settings
	TIM2->CCER2 = 	(0<<1) |				//OC3: 0->active high, 1->active low
					(0<<0) |				//OC3: 1->enable OC2, 0->disable OC2
					0x00;
#endif										//tim2
	
#if defined(TIM3) && defined(USE_PWM3)
	//enable the clock to TIM3
	CLK->PCKENR1 |= CLK_PCKENR1_TIM3;					//'1'=clock enabled, '0'=clock disabled
	TIM3->CR1 = (1<<7) |					//'1'->enable auto reload buffer
	  			//(1<<5) |					//'0'->edge aligned. 1..3->center aligned
				//(0<<4) |					//'0'->up counter, '1' downcounter
				(0<<3) |					//'0'->continuous mode, '1'->one pulse mode
				(0<<2) |					//'0'-> update enable source
				(0<<1) |					//'0'-> update enabled
				(0<<0);						//counter disabled
	TIM3->PSCR = (PWMOUT_PS) & 0x0f;		//4-bit prescaler, valid range [0..15], 2^PSCR divider, 0 = 1:1.
	TIM3->CNTRH = TIM1->CNTRL = 0;			//reset the counter
	TIM3->ARRH = (PWM_PR)>>8; 
	TIM3->ARRL = (PWM_PR);					//top at 0x0fff
	TIM3->SR1 &=~(1<<0);					//clear uif
	TIM3->CR1 |= (1<<0);					//start the timer
	
	//configure TIM3/OC1/2 -> output disabled
	TIM3->CCMR1 = 	(7<<4) |				//0b110->PWM mode 1, 0b111->PWM mode 2
					(0<<3) |				//'0'->OCiPE disabled, '1'->OCiPE enabled
					(0<<0);					//0b00->OCi as output
	TIM3->CCMR2 = TIM3->CCMR1;
	TIM3->CCER1 = 	(0<<5) |				//OC2: 0->active high, 1->active low
					(0<<4) |				//OC2: 1->enable OC2, 0->disable OC2
					(0<<1) |				//OC1: 0->active high, 1->active low
					(0<<0) |				//OC1: 1->enable OC2, 0->disable OC2
					0x00;
	//OC3 not present on TIM3
	
#endif										//tim3


#if defined(USE_ADC1)
	//route clock to ADC
	CLK->PCKENR2 |= CLK_PCKENR2_ADC;		//'1'=clock enabled, '0'=clock disabled
	//configure the adc
	ADC1->CR1 = ((ADC1_PS)<<4) |			//3-bit adc prescaler: 7 = Fmaster / 18, 6 = Fmaster / 12, ...
				0x00;
	ADC1->CR2 = (0<<6) |					//0->conversion on external trigger disabled
				(0<<4) |					//0->external event -> TIM1 TRGO
				(1<<3) |					//'1'->right aligned, '0'->left aligned
				(0<<1) |					//'0'->scan disabled, '1'->scan enabled
				0x00;
	ADC1->CR3 = (0<<7);						//'0'->data buffer disabled, read from DRH..DRL
	ADC1->CR1 |= (1<<0);					//turn on the adc
#endif										//ADC1
	
	//configure beep / tone generator
	BEEP->CSR = (0x00 << 6) |					//set divider: 0b00->Fls/8, 0b01->Fls/4, 0b1x->Fls/2. default: 8x
				(0<<5) |						//0->disable beep, 1->enable beep
				(((128000ul/ F_TONE / 8 > 2)?(128000ul / F_TONE / 8 - 2):0) & 0x1f);					//set beep divider. 0x00->2:1, 0x01->3:1, 0x1e->32:1
	//tone off at start-up
	
#if defined(USE_EXTI)
	//configure EXTI
	//use default / boot-up EXTI values
#endif										//exti
	
#if defined(USE_SPI)
	//configure SPI
	//route clock to SPI
	CLK->PCKENR1 |= CLK_PCKENR1_SPI;		//'1'=clock enabled, '0'=clock disabled
    //stop spi
    //SPI->CR1 &=~(1<<6);                     //'1'->enable spi, '0'->disable spi
    //set up the clock ...
    SPI->CR1 =  (0<<7) |                     //'0'->MSB first, '1'->LSB first
                (0<<6) |                    //'0'->spi disabled, '1'->spi enabled
                (((SPI_PS) & 0x07) << 3) |  //set 3-bit spi prescaler, 0..7 -> 2:1 ... 256:1
                (1<<2) |                    //'1'->master, '0'->slave
                (0<<1) |                    //'0'->SCK idles low, '1'->SCK idles high
                (0<<0) |                    //'0'->the first clock transition is the first data capture edge, '1'->the second clock transition is the first data capture edge
                0x00;
    SPI->CR2 =  (0<<7) |                    //'0'->2-line unidirectional data mode, '1'->1-line bidirectional data mode
                (0<<6) |                    //'0'->input enabled (receive-only mode), '1'->output enabled (transmit only mode)
                (0<<5) |                    //'0'->CRC calculation disabled, '1'->CRC calculation enabled
                (0<<4) |                    //'0'->next transmit value is from Tx buffer, '1'->next transmit value is from Tx CRC register
                (0<<2) |                    //'0'->full duplex (transmit and receive), '1'->output disabled (receive inly)
                (0<<1) |                    //'0'->software slave management disabled, '1'->software slave management enabled
                (0<<0) |                    //'0'->slave mode, '1'->Master mode. This bit has effect only when SSM bit (bit 1 of CR2) is set
                0x00;
    SPI->ICR =  (0<<7) |                     //'0'->disable TX interrupt
                (0<<6) |                    //'0'->disable RX interrupt
                (0<<5) |                    //'0'->disable spi error interrupt
                (0<<4) |                    //'0'->disable spi wakeup interrupt
				0x00;
    SPI->SR = 0;                            //'0'->clear all error status
    SPI->DR = 0;                            //clear spi data register
    SPI->CR1|= (1<<6);                      //'0'->disable spi, '1'->enable spi
    //spi is now enabled    
#endif										//spi

