dannyf00/STM8Sduino/stm8sduino.c
#if defined(USE_I2C)
	//configure i2c
	//route clock to i2c
	CLK->PCKENR1 |= CLK_PCKENR1_I2C;		//'1'=clock enabled, '0'=clock disabled
    //configure i2c
	I2C->CR1 &=~(1<<0);						//'0'->disable i2c, '1'->enable i2c
	I2C->CR2 = 	(0<<7) |					//'0'->software reset disabled, '1'->software reset enabled
				(0<<3) |					//'0'->ACK bit controls acknowledge, '1'->ACK bit controls the next byte
				(0<<2) |					//'0'->no ACK returned, '1'->ACK returned. can only be set after PE = 1
				(0<<1) |					//'0'->don't generate stop condition, '1'->generate a stop condition
				(0<<0) |					//'0'->don't generate a start condition, '1'->generate a start condition
				0x00;
	I2C->FREQR = clockCyclesPerMicrosecond();
	I2C->FREQR = (I2C->FREQR>=24)?24:((I2C->FREQR==0)?1:I2C->FREQR);	//top at 24Mhz, and bottom at 1Mhz
	I2C->CCRL = (clockCyclesPerMicrosecond() * 10);
	I2C->CCRH = (clockCyclesPerMicrosecond() * 10) >> 8;
#if defined(I2C_FASTMODE)
	I2C->CCRH = (I2C->CCRH & 0x0f) | 		//lowest 4 bits effective
				(1<<7) |					//'1'->fast mode, '0'->standard mode
				(0<<6) |					//'1'->duty cycle 9/(16+9), '0'->duty cycle 2/(3+2)
				0x00;
#else
	I2C->CCRH = (I2C->CCRH & 0x0f) | 		//lowest 4 bits effective
				(0<<7) |					//'1'->fast mode, '0'->standard mode
				(0<<6) |					//'1'->duty cycle 9/(16+9), '0'->duty cycle 2/(3+2)
				0x00;
#endif
    I2C->OARH = (0<<7) |					//'0'-> 7-bit addressing, '1'->10-bit addressing
				(1<<6) |					//ADDCONF bit ***must always be 1***
				(0x00<<1) |					//bit 9..8 of 10-bit own address
				0x00;
	I2C->OARL = 0x00;						//own address, bit 0 don't care
    //I2C->TRISER must be configured before the I2C is turned on
	//1000ns for standard mode and 300ns for fast mode
	if (I2C->CR2 & (1<<7)) {				//fast mode
		I2C->TRISER = I2C->FREQR + 1;		//simple math to configure I2C rise time to 1000ns for standard mode
	} else {								//slow mode
		I2C->TRISER = I2C->FREQR * 3 / 10 + 1;		//simple math to configure I2C rise time to 300ns for fast mode
	}
	//clear interrupt flags and then enable interrupt
	
	//enable i2c
	I2C->CR1 |= (1<<0);						//enable i2c
	//enable ACK
	I2C->CR2 |= (1<<2);						//'1'->send ACK,'0'->don't send ACK - can only be set after PE = 1
#endif										//i2c
	
	//always enable interrupts - for micros/millis
	interrupts();
}

//templated code for main()
int main(void) {
	mcu_init();							//reset the chip
	setup();							//user-set up the code
	while (1) {
		loop();							//user specified loop
	}
	return 0;
}

